app/controllers/recipes_controller.rb

SELECT COUNT(*) FROM `recipes`
SELECT `recipes`.* FROM `recipes` ORDER BY `recipes`.`created_at` DESC LIMIT 6 OFFSET 0
---
  def index
    # recipe = Recipe.all.order(created_at: :desc)
    # render json: recipe
    recipes = Recipe.page(params[:page]).order(created_at: :desc)

INSERT INTO `recipes` (`name`, `ingredients`, `instruction`, `created_at`, `updated_at`) VALUES ('Test', 'butter, salt, bread, eggs', 'Throw in pan and fry', '2021-05-14 20:59:25.516578', '2021-05-14 20:59:25.516578')
---
  def create
    recipe = Recipe.create!(recipe_params)

DELETE FROM `recipes` WHERE `recipes`.`id` = 1
---
  def destroy
    recipe&.destroy

SELECT `recipes`.* FROM `recipes` INNER JOIN `recipes_weeks` ON `recipes`.`id` = `recipes_weeks`.`recipe_id` WHERE `recipes_weeks`.`week_id` = 87
SELECT `weeks`.* FROM `weeks` WHERE `weeks`.`id` = NULL LIMIT 1
---
  def get_week
    recipes = Week.find(params[:week_id]).recipes.all

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 89 LIMIT 1
SELECT `weeks`.* FROM `weeks` WHERE `weeks`.`id` = 82 LIMIT 1
---
  def assign_week
    recipe = Recipe.find(params[:recipe_id])
    week = Week.find(params[:week_id])

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 85 LIMIT 1
---
  def recipe
    @recipe ||= Recipe.find(params[:id])