app/controllers/weeks_controller.rb

SELECT COUNT(*) FROM `weeks`
SELECT `weeks`.* FROM `weeks` ORDER BY `weeks`.`created_at` DESC LIMIT 6 OFFSET 0
---
  def index
    week = Week.page(params[:page]).order(created_at: :desc)

SELECT `weeks`.* FROM `weeks` ORDER BY `weeks`.`id` DESC LIMIT 1
---
  def index_all
    weeks = Week.all

INSERT INTO `weeks` (`number`, `name`, `created_at`, `updated_at`) VALUES (9, 'The best week', '2021-05-15 22:31:28.926024', '2021-05-15 22:31:28.926024')
---
  def create
    week = Week.create!(week_params)

SELECT `weeks`.* FROM `weeks` ORDER BY `weeks`.`id` DESC LIMIT 1
---
  def last
    week = Week.last

SELECT `weeks`.* FROM `weeks` WHERE `weeks`.`id` = 86 LIMIT 1
---
  def week
    @week ||= Week.find(params[:id])