app/models/recipe.rb

  def total_pages
    (Recipe.all.count.to_f / 6).ceil
---
SELECT COUNT(*) FROM `recipes`