app/models/week.rb

    def total_pages
      (Week.all.count.to_f / 7).ceil
---
SELECT COUNT(*) FROM `weeks`